Lab_sessions/lab_02.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:nil
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: R modelling. Lab session 02
#+date:
#+author: Daniel Ballesteros Chávez.
#+email: daniel@linuxdeb.home
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.1 (Org mode 9.3.6)
# +OPTIONS: html-style:nil

# Daniel Ballesteros-Chávez

#+HTML_HEAD: <style type="text/css"> tr:nth-child(odd) {background-color: #e2e2e2;}  tr:first-child {font-weight: bold}  tr:hover {background-color: #d0c6e5;}</style>
#+HTML_HEAD: <style> pre.src { overflow: auto; }</style>

:results:
#+HTML_HEAD:<style> /* Daniel Ballesteros-Chavez */
#+HTML_HEAD: 
#+HTML_HEAD: :root {
#+HTML_HEAD:   --col0: #2b2d42;		/*Top bar*/
#+HTML_HEAD:   --col1: #8d99ae;		/* Section header bg*/
#+HTML_HEAD:   --col2: #edf2f4;		/*body bg*/
#+HTML_HEAD:   --col3: #ef233c;		/*Active top bar*/
#+HTML_HEAD:   --col4: #d90429;		/*Home botton bg*/
#+HTML_HEAD:   --col5: #173f5f; 		/*H2 header*/
#+HTML_HEAD: 
#+HTML_HEAD: }
#+HTML_HEAD: 
#+HTML_HEAD: body {
#+HTML_HEAD:     /*    background-image: url('./Images/bgpic.jpg'); */
#+HTML_HEAD:     background-size: cover;
#+HTML_HEAD:     background-attachment: fixed;
#+HTML_HEAD: 	font-family: Helvetica;
#+HTML_HEAD:     /* background-position: left top; */
#+HTML_HEAD:     /* background-repeat: no-repeat; */
#+HTML_HEAD:     background: var(--col2);
#+HTML_HEAD:     margin: 20px auto; /* "auto" for centering */
#+HTML_HEAD:     max-width: 768px;
#+HTML_HEAD:     /* max-width: 800px; */
#+HTML_HEAD:     /* font-family: monospace; */
#+HTML_HEAD: }
#+HTML_HEAD: 
#+HTML_HEAD: h1 {
#+HTML_HEAD:     display: block;
#+HTML_HEAD:     font-size: 1.5em;
#+HTML_HEAD:     /* margin-top: 0.67em; */
#+HTML_HEAD:     /* margin-bottom: 0.67em; */
#+HTML_HEAD:     margin-left: 0;
#+HTML_HEAD:     margin-right: 0;
#+HTML_HEAD:     font-weight: bold;
#+HTML_HEAD:     color: var(--col0);
#+HTML_HEAD:     padding: 5px 20px;
#+HTML_HEAD:     /*    background-color:#092B39;*/
#+HTML_HEAD:     /*text-align: center; */
#+HTML_HEAD:     /*text-shadow: 3px 2px gray;*/
#+HTML_HEAD: }
#+HTML_HEAD: 
#+HTML_HEAD: h2 {
#+HTML_HEAD:     display: block;
#+HTML_HEAD:     font-size: 1em;
#+HTML_HEAD:     margin-top: 0.67em;
#+HTML_HEAD:     margin-bottom: 0.67em;
#+HTML_HEAD:     margin-left: 0;
#+HTML_HEAD:     margin-right: 0;
#+HTML_HEAD:     font-weight: bold;
#+HTML_HEAD:     color: var(--col0);
#+HTML_HEAD:     background-color: var(--col1);
#+HTML_HEAD:     border-radius: 10px 10px;
#+HTML_HEAD:     padding: 10px 20px;
#+HTML_HEAD:     /*    background-color:#092B39;*/
#+HTML_HEAD: }
#+HTML_HEAD: 
#+HTML_HEAD: div.outline-2 {
#+HTML_HEAD:     background-color: var(--col2);
#+HTML_HEAD:     /* border:3px solid #f2f6f9; */
#+HTML_HEAD:     color: var(--col0);
#+HTML_HEAD: }
#+HTML_HEAD: 
#+HTML_HEAD: div.outline-2 h2 {
#+HTML_HEAD:     color: var(--col5);
#+HTML_HEAD:     font-size: 20px; /* arial, sans-serif; */
#+HTML_HEAD:     /* font-family: 'Fredoka One', cursive; */
#+HTML_HEAD: }
#+HTML_HEAD: 
#+HTML_HEAD: 
#+HTML_HEAD: div.outline-text-2 {
#+HTML_HEAD: }
#+HTML_HEAD: 
#+HTML_HEAD: div.outline-text-2 p {
#+HTML_HEAD:     text-align: justify;
#+HTML_HEAD: }
#+HTML_HEAD: 
#+HTML_HEAD: </style>
:end:


* Review from last session:

+ Do I feel comfortable Starting a New R session?
  + [ ] Yes
  + [ ] No
+ Do I know how to Install a package?
  + [ ] Yes
  + [ ] No
+ to know my current working directory
  + [ ] getwd()
  + [ ] setwd()
+ To change the working directory?
  + [ ] getwd()
  + [ ] setwd()
+ Loading a package
  + [ ] load("packagename")
  + [ ] library("packagename")
+ Loading a csv file into an R session
  + [ ] df <- read.csv("path/to/file.csv", header=TRUE, sep=",")
  + [ ] df <- save.csv("path/to/file.csv", header=TRUE, sep=",")
+ Loading a csv file into an R session
  + [ ] df <- read.csv("path/to/file.csv", header=TRUE, sep=",")
  + [ ] df <- save.csv("path/to/file.csv", header=TRUE, sep=",")

* Instructions:

Write a file lab2\under{}solutions.R with your code with your solutions.
You can use ~apropos()~, ~?~, or google in case you are looking for available functions.
Try to solve this using built-in functions a

* Practice 1. Use R to perform calculations. 

This part is about the =seq= function. You can display the help for the function =seq= in your R session.

   + Create the sequence 0.0, 0.2, 0.4, 0.6, 0.8, 1.0, first using the option by=, and then using the option =length.out=.

   + Create the sequence of all even numbers from 0 to 100

   + Create the sequence of all odd numbers from 1 to 100

   + Recall that 1:5 is the sequence 1 2 3 4 5. Verify with a few examples (n=10,15 and 60) that  \[ \sum_{k=1}^n k^3 = \left( \frac{n (n+1)}{2}\right)^2 \]

   + To generate the sequence  5 5 5 5 5 5 5 5 5 , we use
     1) [ ] rep(1:9, 2)
     2) [ ] rep(1:4, each = 2)
     3) [ ] rep(5,9)
     4) [ ] rep(1:5, each = 2, times = 3)

   + To generate the sequence 1 1 2 2 3 3 4 4, we use
     1) [ ] rep(5,5)
     2) [ ] rep(1:9, 2)
     3) [ ] rep(1:5, each = 2, times = 3)
     4) [ ] rep(1:4, each = 2)

   + To generate the sequence 1 1 2 2 3 3 1 1 2 2 3 3 1 1 2 2 3 3, we use
     1) [ ] rep(3,5)
     2) [ ] rep(1:9, 2)
     3) [ ] rep(1:3, each = 2, times = 3)
     4) [ ] rep(1:3, each = 2)


