Lab_sessions/lab_02.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-11 Tue 14:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>R modelling. Lab session 02</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel Ballesteros Chávez." />
</head>
<body>
<div id="content">
<h1 class="title">R modelling. Lab session 02</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgeb7abd8">Review from last session:</a></li>
<li><a href="#org9c8ac11">Instructions:</a></li>
<li><a href="#org948d97e">Practice 1. Use R to perform calculations.</a></li>
<li><a href="#orgba56fcf">Practice 2. Subsets of data sets</a></li>
<li><a href="#org8e57054">Practice 3. Matrices</a></li>
<li><a href="#org64a7ed4">Practice 4:  table, apply, tapply, &#x2026;</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgeb7abd8" class="outline-2">
<h2 id="orgeb7abd8">Review from last session:</h2>
<div class="outline-text-2" id="text-orgeb7abd8">
<ul class="org-ul">
<li>Do I feel comfortable Starting a New R session?
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Yes</li>
<li class="off"><code>[&#xa0;]</code> No</li>
</ul></li>
<li>Do I know how to Install a package?
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Yes</li>
<li class="off"><code>[&#xa0;]</code> No</li>
</ul></li>
<li>to know my current working directory
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> getwd()</li>
<li class="off"><code>[&#xa0;]</code> setwd()</li>
</ul></li>
<li>To change the working directory?
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> getwd()</li>
<li class="off"><code>[&#xa0;]</code> setwd()</li>
</ul></li>
<li>Loading a package
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> load("packagename")</li>
<li class="off"><code>[&#xa0;]</code> library("packagename")</li>
</ul></li>
<li>Loading a csv file into an R session
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> df &lt;- read.csv("path/to/file.csv", header=TRUE, sep=",")</li>
<li class="off"><code>[&#xa0;]</code> df &lt;- save.csv("path/to/file.csv", header=TRUE, sep=",")</li>
</ul></li>
<li>Loading a csv file into an R session
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> df &lt;- read.csv("path/to/file.csv", header=TRUE, sep=",")</li>
<li class="off"><code>[&#xa0;]</code> df &lt;- save.csv("path/to/file.csv", header=TRUE, sep=",")</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9c8ac11" class="outline-2">
<h2 id="org9c8ac11">Instructions:</h2>
<div class="outline-text-2" id="text-org9c8ac11">
<p>
Write a file lab2_solutions.R with your code with your solutions.
You can use <code>apropos()</code>, <code>?</code>, or google in case you are looking for available functions.
Try to solve this using built-in functions a
</p>
</div>
</div>

<div id="outline-container-org948d97e" class="outline-2">
<h2 id="org948d97e">Practice 1. Use R to perform calculations.</h2>
<div class="outline-text-2" id="text-org948d97e">
<p>
This part is about the <code>seq</code> function. You can display the help for the function <code>seq</code> in your R session.
</p>

<ul class="org-ul">
<li>Create the sequence 0.0, 0.2, 0.4, 0.6, 0.8, 1.0, first using the option by=, and then using the option <code>length.out</code>.</li>

<li>Create the sequence of all even numbers from 0 to 100</li>

<li>Create the sequence of all odd numbers from 1 to 100</li>

<li>Recall that 1:5 is the sequence 1 2 3 4 5. Verify with a few examples (n=10,15 and 60) that  \[ \sum_{k=1}^n k^3 = \left( \frac{n (n+1)}{2}\right)^2 \]</li>

<li>To generate the sequence  5 5 5 5 5 5 5 5 5 , we use
<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> rep(1:9, 2)</li>
<li class="off"><code>[&#xa0;]</code> rep(1:4, each = 2)</li>
<li class="off"><code>[&#xa0;]</code> rep(5,9)</li>
<li class="off"><code>[&#xa0;]</code> rep(1:5, each = 2, times = 3)</li>
</ol></li>

<li>To generate the sequence 1 1 2 2 3 3 4 4, we use
<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> rep(5,5)</li>
<li class="off"><code>[&#xa0;]</code> rep(1:9, 2)</li>
<li class="off"><code>[&#xa0;]</code> rep(1:5, each = 2, times = 3)</li>
<li class="off"><code>[&#xa0;]</code> rep(1:4, each = 2)</li>
</ol></li>

<li>To generate the sequence 1 1 2 2 3 3 1 1 2 2 3 3 1 1 2 2 3 3, we use
<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> rep(3,5)</li>
<li class="off"><code>[&#xa0;]</code> rep(1:9, 2)</li>
<li class="off"><code>[&#xa0;]</code> rep(1:3, each = 2, times = 3)</li>
<li class="off"><code>[&#xa0;]</code> rep(1:3, each = 2)</li>
</ol></li>
</ul>
</div>
</div>
