Lab_sessions/lab_02.org
* Practice 2. Subsets of data sets

Recall that the names of the variables in a data frame can be obtained using

#+begin_example R
names(df)
#+end_example

The unique values of the variable ~var1~ are obtained by using

#+begin_example R
unique(df$var1)
#+end_example

If we have a data frame ~df~, then we can use the following syntax to obtain a subsets:
#+begin_example R
df[c(1,5), c(4,5)]
#+end_example

#+begin_example R
df[c(1,5), c("var4", "var5")]
#+end_example

#+begin_example R
df[df$var1%in%condition1 & df$var2==condition2 | df$var3%in%condition3, c("colname1","colname2")]
#+end_example

In order to create a new variable (column) in data frame, we can use the following syntax

#+begin_example R
df$NEWVAR <- 1   #this will create a column with the constant value 1
#+end_example

#+begin_example R
df$NEWVAR <- df$var1 + df$var2   #this will create a new column out of existing ones.
#+end_example


*A) From the data set /Population projection by sex and 5-year age groups/, reproduce the following table which contains the information of the projected population in Poland for the year 2035*


#+begin_src R :exports results :results table :colnames yes
df <-  read.csv("../Data_sets/LUDN_3560_CREL_20220930132437.csv",sep=";")
x  <-  unique(df$Projection.for.year)
x[9]
df2 <-  df[df$Name%in%"POLAND"&df$Projection.for.year%in%x[9]&df$Sex%in%"total"&df$Domicile%in%"total", c("Name","Projection.for.year","Sex","Age","Domicile","Value")]
#+end_src

#+RESULTS:
| Name   | Projection.for.year      | Sex   |         Age | Domicile |    Value |
|--------+--------------------------+-------+-------------+----------+----------|
| POLAND | projection for year 2035 | total |       total | total    | 36476771 |
| POLAND | projection for year 2035 | total |         0-4 | total    |  1406012 |
| POLAND | projection for year 2035 | total |         5-9 | total    |  1497932 |
| POLAND | projection for year 2035 | total |       10-14 | total    |  1632310 |
| POLAND | projection for year 2035 | total |       15-19 | total    |  1727721 |
| POLAND | projection for year 2035 | total |       20-24 | total    |  1854110 |
| POLAND | projection for year 2035 | total |       25-29 | total    |  2050648 |
| POLAND | projection for year 2035 | total |       30-34 | total    |  1790869 |
| POLAND | projection for year 2035 | total |       35-39 | total    |  1962681 |
| POLAND | projection for year 2035 | total |       40-44 | total    |  2371138 |
| POLAND | projection for year 2035 | total |       45-49 | total    |  2752420 |
| POLAND | projection for year 2035 | total |       50-54 | total    |  3106617 |
| POLAND | projection for year 2035 | total |       55-59 | total    |  2913513 |
| POLAND | projection for year 2035 | total |       60-64 | total    |  2493897 |
| POLAND | projection for year 2035 | total |       65-69 | total    |  2041149 |
| POLAND | projection for year 2035 | total |       70-74 | total    |  1959820 |
| POLAND | projection for year 2035 | total |       75-79 | total    |  2046625 |
| POLAND | projection for year 2035 | total |       80-84 | total    |  1599863 |
| POLAND | projection for year 2035 | total | 85 and more | total    |  1269446 |



*B) Form the last data frame, create a new variable to get the percentage of each population age range with respect to the total population for 2035*

Reproduce the following table

#+begin_src R :exports results :results table :colnames yes
df <-  read.csv("../Data_sets/LUDN_3560_CREL_20220930132437.csv",sep=";")
x  <-  unique(df$Projection.for.year)
x[9]
df2 <-  df[df$Name%in%"POLAND"&df$Projection.for.year%in%x[9]&df$Sex%in%"total"&df$Domicile%in%"total", c("Name","Projection.for.year","Sex","Age","Domicile","Value")]
df3  <-  df2
df3$Share  <- round( 100 * df3$Value / df3$Value[1],2)
df3[,c(1,2,4,6,7)]
#+end_src

#+RESULTS:
| Name   | Projection.for.year      |         Age |    Value | Share |
|--------+--------------------------+-------------+----------+-------|
| POLAND | projection for year 2035 |       total | 36476771 |   100 |
| POLAND | projection for year 2035 |         0-4 |  1406012 |  3.85 |
| POLAND | projection for year 2035 |         5-9 |  1497932 |  4.11 |
| POLAND | projection for year 2035 |       10-14 |  1632310 |  4.47 |
| POLAND | projection for year 2035 |       15-19 |  1727721 |  4.74 |
| POLAND | projection for year 2035 |       20-24 |  1854110 |  5.08 |
| POLAND | projection for year 2035 |       25-29 |  2050648 |  5.62 |
| POLAND | projection for year 2035 |       30-34 |  1790869 |  4.91 |
| POLAND | projection for year 2035 |       35-39 |  1962681 |  5.38 |
| POLAND | projection for year 2035 |       40-44 |  2371138 |   6.5 |
| POLAND | projection for year 2035 |       45-49 |  2752420 |  7.55 |
| POLAND | projection for year 2035 |       50-54 |  3106617 |  8.52 |
| POLAND | projection for year 2035 |       55-59 |  2913513 |  7.99 |
| POLAND | projection for year 2035 |       60-64 |  2493897 |  6.84 |
| POLAND | projection for year 2035 |       65-69 |  2041149 |   5.6 |
| POLAND | projection for year 2035 |       70-74 |  1959820 |  5.37 |
| POLAND | projection for year 2035 |       75-79 |  2046625 |  5.61 |
| POLAND | projection for year 2035 |       80-84 |  1599863 |  4.39 |
| POLAND | projection for year 2035 | 85 and more |  1269446 |  3.48 |




