Lab_sessions/lab_02.html


<div id="outline-container-orgba56fcf" class="outline-2">
<h2 id="orgba56fcf">Practice 2. Subsets of data sets</h2>
<div class="outline-text-2" id="text-orgba56fcf">
<p>
Recall that the names of the variables in a data frame can be obtained using
</p>

<pre class="example">
names(df)
</pre>

<p>
The unique values of the variable <code>var1</code> are obtained by using
</p>

<pre class="example">
unique(df$var1)
</pre>

<p>
If we have a data frame <code>df</code>, then we can use the following syntax to obtain a subsets:
</p>
<pre class="example">
df[c(1,5), c(4,5)]
</pre>

<pre class="example">
df[c(1,5), c("var4", "var5")]
</pre>

<pre class="example">
df[df$var1%in%condition1 &amp; df$var2==condition2 | df$var3%in%condition3, c("colname1","colname2")]
</pre>

<p>
In order to create a new variable (column) in data frame, we can use the following syntax
</p>

<pre class="example">
df$NEWVAR &lt;- 1   #this will create a column with the constant value 1
</pre>

<pre class="example">
df$NEWVAR &lt;- df$var1 + df$var2   #this will create a new column out of existing ones.
</pre>


<p>
<b>A) From the data set <i>Population projection by sex and 5-year age groups</i>, reproduce the following table which contains the information of the projected population in Poland for the year 2035</b>
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Projection.for.year</th>
<th scope="col" class="org-left">Sex</th>
<th scope="col" class="org-right">Age</th>
<th scope="col" class="org-left">Domicile</th>
<th scope="col" class="org-right">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">total</td>
<td class="org-left">total</td>
<td class="org-right">36476771</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">0-4</td>
<td class="org-left">total</td>
<td class="org-right">1406012</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">5-9</td>
<td class="org-left">total</td>
<td class="org-right">1497932</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">10-14</td>
<td class="org-left">total</td>
<td class="org-right">1632310</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">15-19</td>
<td class="org-left">total</td>
<td class="org-right">1727721</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">20-24</td>
<td class="org-left">total</td>
<td class="org-right">1854110</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">25-29</td>
<td class="org-left">total</td>
<td class="org-right">2050648</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">30-34</td>
<td class="org-left">total</td>
<td class="org-right">1790869</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">35-39</td>
<td class="org-left">total</td>
<td class="org-right">1962681</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">40-44</td>
<td class="org-left">total</td>
<td class="org-right">2371138</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">45-49</td>
<td class="org-left">total</td>
<td class="org-right">2752420</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">50-54</td>
<td class="org-left">total</td>
<td class="org-right">3106617</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">55-59</td>
<td class="org-left">total</td>
<td class="org-right">2913513</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">60-64</td>
<td class="org-left">total</td>
<td class="org-right">2493897</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">65-69</td>
<td class="org-left">total</td>
<td class="org-right">2041149</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">70-74</td>
<td class="org-left">total</td>
<td class="org-right">1959820</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">75-79</td>
<td class="org-left">total</td>
<td class="org-right">2046625</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">80-84</td>
<td class="org-left">total</td>
<td class="org-right">1599863</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-left">total</td>
<td class="org-right">85 and more</td>
<td class="org-left">total</td>
<td class="org-right">1269446</td>
</tr>
</tbody>
</table>



<p>
<b>B) Form the last data frame, create a new variable to get the percentage of each population age range with respect to the total population for 2035</b>
</p>

<p>
Reproduce the following table
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Projection.for.year</th>
<th scope="col" class="org-right">Age</th>
<th scope="col" class="org-right">Value</th>
<th scope="col" class="org-right">Share</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">total</td>
<td class="org-right">36476771</td>
<td class="org-right">100</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">0-4</td>
<td class="org-right">1406012</td>
<td class="org-right">3.85</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">5-9</td>
<td class="org-right">1497932</td>
<td class="org-right">4.11</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">10-14</td>
<td class="org-right">1632310</td>
<td class="org-right">4.47</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">15-19</td>
<td class="org-right">1727721</td>
<td class="org-right">4.74</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">20-24</td>
<td class="org-right">1854110</td>
<td class="org-right">5.08</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">25-29</td>
<td class="org-right">2050648</td>
<td class="org-right">5.62</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">30-34</td>
<td class="org-right">1790869</td>
<td class="org-right">4.91</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">35-39</td>
<td class="org-right">1962681</td>
<td class="org-right">5.38</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">40-44</td>
<td class="org-right">2371138</td>
<td class="org-right">6.5</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">45-49</td>
<td class="org-right">2752420</td>
<td class="org-right">7.55</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">50-54</td>
<td class="org-right">3106617</td>
<td class="org-right">8.52</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">55-59</td>
<td class="org-right">2913513</td>
<td class="org-right">7.99</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">60-64</td>
<td class="org-right">2493897</td>
<td class="org-right">6.84</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">65-69</td>
<td class="org-right">2041149</td>
<td class="org-right">5.6</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">70-74</td>
<td class="org-right">1959820</td>
<td class="org-right">5.37</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">75-79</td>
<td class="org-right">2046625</td>
<td class="org-right">5.61</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">80-84</td>
<td class="org-right">1599863</td>
<td class="org-right">4.39</td>
</tr>

<tr>
<td class="org-left">POLAND</td>
<td class="org-left">projection for year 2035</td>
<td class="org-right">85 and more</td>
<td class="org-right">1269446</td>
<td class="org-right">3.48</td>
</tr>
</tbody>
</table>
</div>
</div>
