Lab_sessions/lab_02.org
* Practice 3. Matrices

Define the following matrices (use ?matrix)
\begin{equation}
A = \left( \begin{array}{ccc}
  1  &  0 &   3 \\
  0  &  2 &   1 \\
  2  &  4 &   3 
\end{array}\right)
\end{equation}

\begin{equation}
B = \left( \begin{array}{ccc}
  3  &  3 &   6 \\
 -1  &  2 &   2 \\
  3  &  1 &   3 
\end{array}\right)
\end{equation}

perform the product $C = AB$, where $C$ is the matrix 

\begin{equation}
C_{ij} = \sum_{k=1}^{3} A_{ik}B_{kj}.
\end{equation}


* Practice 4:  table, apply, tapply, ...

Suppose that ~df~ is the data set containing the table ~iris~.

Run the following and discuss the outputs

#+begin_example
table(df$Species)
apply(df[,1:4],1,sum)
apply(df[,1:4],2,sum)
tapply(df$Sepal.Length, df$Species, sum)
aggregate(df$Sepal.Length, list(df$Species), sum)
#+end_example

Use these examples for the following exercise:

The file diamondsCSV.csv contains the  data set
     of 53940 diamonds and 10 other attributes:
     + *price:* price in US dollars (\$326-\$18,823)
     + *carat:* weight of the diamond (0.2-5.01)
     + *cut:* quality of the cut (Fair, Good, Very Good, Premium, Ideal)
     + *color:* diamond colour, from D (best) to J (worst)
     + *clarity:* a measurement of how clear the diamond is (I1 (worst), SI2, SI1, VS2, VS1, VVS2, VVS1, IF (best))
     + *x:* length in mm (0-10.74)
     + *y:* width in mm (0-58.9)
     + *z:* depth in mm (0-31.8)
     + *depth:* total depth percentage (43-79) = 100 * z / mean(x, y) = 100 * 2 * z / (x + y)
     + *table:* width of top of diamond relative to widest point (43-95)

We would like to verify the values in the column "depth", by directly applying the formula given in the description.

a) Are they the same? If not, discuss in the class if one can conclude that the variable depth is wrong or not.
/hint./ A useful way to compare two variables is ~table(df$var1 == df$var2)~.

b) Verify the values of the following table containing the sum of prices grouped by the quality of the cut of the diamonds:

|---------+----------+-----------+----------+----------|
|    Fair |     Good | Very Good |  Premium |    Ideal |
|---------+----------+-----------+----------+----------|
| 7017600 | 19275009 |  48107623 | 63221498 | 74513487 |
|---------+----------+-----------+----------+----------|

c) Use the function tapply to reproduce the previous table.




