Lab_sessions/lab_02.html




<div id="outline-container-org8e57054" class="outline-2">
<h2 id="org8e57054">Practice 3. Matrices</h2>
<div class="outline-text-2" id="text-org8e57054">
<p>
Define the following matrices (use ?matrix)
</p>
\begin{equation}
A = \left( \begin{array}{ccc}
  1  &  0 &   3 \\
  0  &  2 &   1 \\
  2  &  4 &   3 
\end{array}\right)
\end{equation}

\begin{equation}
B = \left( \begin{array}{ccc}
  3  &  3 &   6 \\
 -1  &  2 &   2 \\
  3  &  1 &   3 
\end{array}\right)
\end{equation}

<p>
perform the product \(C = AB\), where \(C\) is the matrix 
</p>

\begin{equation}
C_{ij} = \sum_{k=1}^{3} A_{ik}B_{kj}.
\end{equation}
</div>
</div>


<div id="outline-container-org64a7ed4" class="outline-2">
<h2 id="org64a7ed4">Practice 4:  table, apply, tapply, &#x2026;</h2>
<div class="outline-text-2" id="text-org64a7ed4">
<p>
Suppose that <code>df</code> is the data set containing the table <code>iris</code>.
</p>

<p>
Run the following and discuss the outputs
</p>

<pre class="example">
table(df$Species)
apply(df[,1:4],1,sum)
apply(df[,1:4],2,sum)
tapply(df$Sepal.Length, df$Species, sum)
aggregate(df$Sepal.Length, list(df$Species), sum)
</pre>

<p>
Use these examples for the following exercise:
</p>

<p>
The file diamondsCSV.csv contains the  data set
     of 53940 diamonds and 10 other attributes:
</p>
<ul class="org-ul">
<li><b>price:</b> price in US dollars (\$326-\$18,823)</li>
<li><b>carat:</b> weight of the diamond (0.2-5.01)</li>
<li><b>cut:</b> quality of the cut (Fair, Good, Very Good, Premium, Ideal)</li>
<li><b>color:</b> diamond colour, from D (best) to J (worst)</li>
<li><b>clarity:</b> a measurement of how clear the diamond is (I1 (worst), SI2, SI1, VS2, VS1, VVS2, VVS1, IF (best))</li>
<li><b>x:</b> length in mm (0-10.74)</li>
<li><b>y:</b> width in mm (0-58.9)</li>
<li><b>z:</b> depth in mm (0-31.8)</li>
<li><b>depth:</b> total depth percentage (43-79) = 100 * z / mean(x, y) = 100 * 2 * z / (x + y)</li>
<li><b>table:</b> width of top of diamond relative to widest point (43-95)</li>
</ul>

<p>
We would like to verify the values in the column "depth", by directly applying the formula given in the description.
</p>

<p>
a) Are they the same? If not, discuss in the class if one can conclude that the variable depth is wrong or not.
<i>hint.</i> A useful way to compare two variables is <code>table(df$var1 == df$var2)</code>.
</p>

<p>
b) Verify the values of the following table containing the sum of prices grouped by the quality of the cut of the diamonds:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Fair</th>
<th scope="col" class="org-right">Good</th>
<th scope="col" class="org-right">Very Good</th>
<th scope="col" class="org-right">Premium</th>
<th scope="col" class="org-right">Ideal</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">7017600</td>
<td class="org-right">19275009</td>
<td class="org-right">48107623</td>
<td class="org-right">63221498</td>
<td class="org-right">74513487</td>
</tr>
</tbody>
</table>

<p>
c) Use the function tapply to reproduce the previous table.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Ballesteros Chávez.</p>
<p class="date">Created: 2022-10-11 Tue 14:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
